pages/emulation.org
#+setupfile:./hugo_setup.org
#+hugo_slug: emulation
#+TITLE: Emulation

Emulation is the process of simulating a computer with an interpreter that runs the bytecode of compiled programs for that machine.
It's most commonly used to run operating systems inside of others or to play video games.

* Future Reading
http://imrannazar.com/GameBoy-Emulation-in-JavaScript:-The-CPU
https://stackoverflow.com/questions/448673/how-do-emulators-work-and-how-are-they-written#448689
https://github.com/vascofazza/8bit-cpu
https://copetti.org/projects/consoles/nintendo-64/
https://www.youtube.com/watch?v=OjaAToVkoTw&app=desktop
https://www.reddit.com/r/ProgrammingLanguages/comments/deuqx3/write_your_own_virtual_machine/
https://andrewkelley.me/post/jamulator.html
https://stackoverflow.com/questions/11215689/why-does-emulation-have-to-be-done-in-real-time
https://www.internalpointers.com/post/introduction-virtual-memory
https://gist.github.com/hellerbarde/2843375

* PCI Passthrough
A technique for getting near-native performance in an emulator.
https://www.reddit.com/r/VFIO/comments/hyerum/problem_with_pci_passthrough_in_kvmqemu/
https://dominicm.com/gpu-passthrough-qemu-arch-linux/
[[https://github.com/mattrberry/CryBoy][game boy em]]
[[https://github.com/mattrberry/chip-8_nim][chip8 em in nim]]
https://wiki.xxiivv.com/site/gyo.html
