content/posts/emulation.md
+++
title = "Emulation"
author = ["Jacob Chvatal"]
lastmod = 2020-08-02T22:16:37-07:00
slug = "emulation"
draft = false
+++

Emulation is the process of simulating a computer with an interpreter that runs the bytecode of compiled programs for that machine.
It's most commonly used to run operating systems inside of others or to play video games.


## Future Reading {#future-reading}

<http://imrannazar.com/GameBoy-Emulation-in-JavaScript:-The-CPU>
<https://stackoverflow.com/questions/448673/how-do-emulators-work-and-how-are-they-written#448689>
<https://github.com/vascofazza/8bit-cpu>
<https://copetti.org/projects/consoles/nintendo-64/>
<https://www.youtube.com/watch?v=OjaAToVkoTw&app=desktop>
<https://www.reddit.com/r/ProgrammingLanguages/comments/deuqx3/write%5Fyour%5Fown%5Fvirtual%5Fmachine/>
<https://andrewkelley.me/post/jamulator.html>
<https://stackoverflow.com/questions/11215689/why-does-emulation-have-to-be-done-in-real-time>
<https://www.internalpointers.com/post/introduction-virtual-memory>
<https://gist.github.com/hellerbarde/2843375>


## PCI Passthrough {#pci-passthrough}

A technique for getting near-native performance in an emulator.
<https://www.reddit.com/r/VFIO/comments/hyerum/problem%5Fwith%5Fpci%5Fpassthrough%5Fin%5Fkvmqemu/>
<https://dominicm.com/gpu-passthrough-qemu-arch-linux/>
